# steps.py
steps = {
    "Intel": {
        "instructions": [
            "Шаг 1: Установка процессора в сокет материнской платы для процессоров Intel:\n"
            "* Откройте зажимные рычаги.\n"
            "* Ориентируйтесь по ключу.\n"
            "* Установите процессор в сокет.\n"
            "* Закройте зажимные рычаги.\n"
            "[Смотрите видео по установке процессора Intel здесь](https://rutube.ru/video/1c42d5692ee827b3c815e963bc1dcac0/)",
            "Шаг 2: Поставьте материнскую плату на коробку от материнской платы.",
            "Шаг 2.5: Нанесение термопасты на процессор:\n"
            "* Выдавите небольшую каплю новой термопасты на процессор и распределите тонким слоем.\n",
            "Шаг 3: Установка радиатора:\n"
            "* Установите радиатор на процессор.\n"
            "[Смотрите видео по установке радиатора здесь](https://rutube.ru/video/e486e30bd17a23ab09ef2837df8f0b94/)"
        ]
    },
    "AMD": {
        "instructions": [
            "Шаг 1: Установка процессора в сокет материнской платы для процессоров AMD:\n"
            "* Найдите ориентиры.\n"
            "* Выровняйте процессор с ориентирами на сокете.\n"
            "* Установите процессор в сокет.\n"
            "* Закройте зажимной механизм.\n"
            "[Смотрите видео по установке процессора AMD здесь](https://rutube.ru/video/cf6d5d2cfbe19149fde57551e8e53022/)",
            "Шаг 2: Поставьте материнскую плату на коробку от материнской платы.",
            "Шаг 2.5: Нанесение термопасты на процессор:\n"
            "* Выдавите небольшую каплю новой термопасты на процессор и распределите тонким слоем.\n",
            "Шаг 3: Установка радиатора:\n"
            "* Установите радиатор на процессор.\n"
            "[Смотрите видео по установке радиатора здесь](https://rutube.ru/video/e486e30bd17a23ab09ef2837df8f0b94/)"
        ]
    },
    "M.2": {
        "instructions": [
            "Шаг 6: Установка M.2 накопителя:\n"
            "* Найдите слот для M.2 на материнской плате.\n"
            "* Аккуратно вставьте M.2 накопитель в слот и зафиксируйте его винтом.\n"
            "[Смотрите видео по установке M.2 накопителя здесь](https://rutube.ru/video/fa86b5395ed102e415eb00d8a3b2f9fd/)"
        ]
    }
}